In [1]:
import pandas as pd
dt=pd.read_excel('Groups.xlsx')
dt

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [2]:
dt.head()

   Group A  Group B  Group C
0       23       19       14
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26

In [3]:
dt.head(2)

   Group A  Group B  Group C
0       23       19       14
1       21       21       13

In [4]:
dt.shape

(7, 3)

In [5]:
dt.tail()

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29
6       26       24       21

In [6]:
dt.columns

Index(['Group A', 'Group B', 'Group C'], dtype='object')

In [7]:
dt.dtypes

Group A    int64
Group B    int64
Group C    int64
dtype: object

In [8]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Group A  7 non-null      int64
 1   Group B  7 non-null      int64
 2   Group C  7 non-null      int64
dtypes: int64(3)
memory usage: 296.0 bytes

In [10]:
dt['Group A']

0    23
1    21
2    19
3    23
4    23
5    22
6    26
Name: Group A, dtype: int64

In [11]:
dt[['Group A']]

   Group A
0       23
1       21
2       19
3       23
4       23
5       22
6       26

In [12]:
dt.sample(2)

   Group A  Group B  Group C
1       21       21       13
2       19       25       31

In [13]:
dt.sample(2)

   Group A  Group B  Group C
2       19       25       31
6       26       24       21

In [14]:
dt.sample(3)

   Group A  Group B  Group C
0       23       19       14
2       19       25       31
5       22       30       29

In [15]:
dt[['Group A']].head()

   Group A
0       23
1       21
2       19
3       23
4       23

In [17]:
dt[['Group B']].head()

   Group B
0       19
1       21
2       25
3       29
4       28

In [18]:
dt[['Group B']].tail()

   Group B
2       25
3       29
4       28
5       30
6       24

In [19]:
dt[2:5]

   Group A  Group B  Group C
2       19       25       31
3       23       29       23
4       23       28       26

In [20]:
dt[1:6]

   Group A  Group B  Group C
1       21       21       13
2       19       25       31
3       23       29       23
4       23       28       26
5       22       30       29

In [21]:
dt[-2:]

   Group A  Group B  Group C
5       22       30       29
6       26       24       21

In [22]:
dt[-3:]

   Group A  Group B  Group C
4       23       28       26
5       22       30       29
6       26       24       21